gw/ctcc/ISMP/IsmpSpEngineSoapBinding.spWithdrawSubscription.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns2="http://req.sp.ismp.chinatelecom.com"
  xmlns:ns3="http://rsp.sp.ismp.chinatelecom.com"
  xmlns:ns1="http://sp.ismp.chinatelecom.com">
 <SOAP-ENV:Body>
   <ns1:spWithdrawSubscriptionReqPara>
    <ns2:userIDType>0</ns2:userIDType>
    <ns2:userID></ns2:userID>
    <ns2:IDType>0</ns2:IDType>
    <ns2:ID></ns2:ID>
    <ns2:streamingNo></ns2:streamingNo>
    <ns2:SPID></ns2:SPID>
    <ns2:SPAdmin></ns2:SPAdmin>
    <ns2:SPAdminPwd></ns2:SPAdminPwd>
   </ns1:spWithdrawSubscriptionReqPara>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
